In [1]:
import pandas as pd

/home/ike/.local/lib/python3.10/site-packages/pandas/core/arrays/masked.py:62: UserWarning: Pandas requires version '1.3.4' or newer of 'bottleneck' (version '1.3.2' currently installed).
  from pandas.core import (

In [2]:
import warnings
warnings.filterwarnings("ignore")

### Desafio 1: Vendas Clientes
----

#### Importando dados

In [3]:
# Lendo Json
df_vendas = pd.read_json('./dados_vendas_clientes.json')

# Normalizando Json
df_vendas = pd.json_normalize(df_vendas['dados_vendas'])
df_vendas

,Data de venda,Cliente,Valor da compra
0,06/06/2022,"[@ANA _LUCIA 321, DieGO ARMANDIU 210, DieGO AR...","[R$ 836,5, R$ 573,33, R$ 392,8, R$ 512,34]"
1,07/06/2022,"[Isabely JOanes 738, Isabely JOanes 738, Isabe...","[R$ 825,31, R$ 168,07, R$ 339,18, R$ 314,69]"
2,08/06/2022,"[Isabely JOanes 738, JOãO Gabriel 671, Julya m...","[R$ 682,05, R$ 386,34, R$ 622,65, R$ 630,79]"
3,09/06/2022,"[Julya meireles 914, MaRIA Julia 444, MaRIA Ju...","[R$ 390,3, R$ 759,16, R$ 334,47, R$ 678,78]"
4,10/06/2022,"[MaRIA Julia 444, PEDRO PASCO 812, Paulo castr...","[R$ 314,24, R$ 311,15, R$ 899,16, R$ 885,24]"

#### Organizando e etendendo os dados

In [4]:
colunas = list(df_vendas.columns)

df_vendas = df_vendas.explode(colunas[1:])
df_vendas.reset_index(inplace=True, drop=True)
df_vendas.head()

  Data de venda             Cliente Valor da compra
0    06/06/2022     @ANA _LUCIA 321        R$ 836,5
1    06/06/2022  DieGO ARMANDIU 210       R$ 573,33
2    06/06/2022  DieGO ARMANDIU 210        R$ 392,8
3    06/06/2022  DieGO ARMANDIU 210       R$ 512,34
4    07/06/2022  Isabely JOanes 738       R$ 825,31

#### Dados Numéricos

In [5]:
import numpy as np

In [6]:
df_vendas['Valor da compra'] = df_vendas['Valor da compra'].apply(lambda x: x.replace('R$ ','').replace(',','.'))
df_vendas['Valor da compra'] = df_vendas['Valor da compra'].astype(np.float64)
df_vendas.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 20 entries, 0 to 19
Data columns (total 3 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   Data de venda    20 non-null     object
 1   Cliente          20 non-null     object
 2   Valor da compra  20 non-null     float64
dtypes: float64(1), object(2)
memory usage: 608.0+ bytes

#### Dados Textuais

nomes dos clientes em letras minúsculas, com a ausência de caracteres especiais ou números.

In [7]:
df_vendas['Cliente'] = df_vendas['Cliente'].str.lower()
# Removendo caracteres especiais
df_vendas['Cliente'] = df_vendas['Cliente'].str.replace('[^a-z]', ' ', regex=True)
df_vendas['Cliente'] = df_vendas['Cliente'].str.replace('(?<!\w)-(?!\w)','', regex=True)
# Tokenizando com split()
df_vendas['Cliente'] = df_vendas['Cliente'].str.split()

df_vendas.head(1)

  Data de venda       Cliente  Valor da compra
0    06/06/2022  [ana, lucia]            836.5

#### Dados Temporais

In [13]:
# Transformando pra datetime
df_vendas['Data de venda'] = pd.to_datetime(df_vendas['Data de venda'], format = "%d/%m/%Y")
df_vendas.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 20 entries, 0 to 19
Data columns (total 3 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   Data de venda    20 non-null     datetime64[ns]
 1   Cliente          20 non-null     object
 2   Valor da compra  20 non-null     float64
dtypes: datetime64[ns](1), float64(1), object(1)
memory usage: 608.0+ bytes

In [15]:
# Gerando subset mostando vendas de cada 5 dias
df_vendas.groupby(df_vendas['Data de venda'].strftime('%d/%m'))[['Valor da compra']].sum()

AttributeError: 'Series' object has no attribute 'strftime'

### Desafio 2: Locação
---

#### Importando dados

In [82]:
# Lendo Json
df_loc = pd.read_json('./dados_locacao_imoveis.json')

# Normalizando Json
df_loc = pd.json_normalize(df_loc['dados_locacao'])
df_loc

,apartamento,datas_combinadas_pagamento,datas_de_pagamento,valor_aluguel
0,A101 (blocoAP),"[01/06/2022, 01/07/2022]","[05/06/2022, 03/07/2022]","[$ 1000,0 reais, $ 2500,0 reais]"
1,A102 (blocoAP),"[02/06/2022, 02/07/2022]","[02/06/2022, 06/07/2022]","[$ 1100,0 reais, $ 2600,0 reais]"
2,B201 (blocoAP),"[03/06/2022, 03/07/2022]","[07/06/2022, 03/07/2022]","[$ 1200,0 reais, $ 2700,0 reais]"
3,B202 (blocoAP),"[04/06/2022, 04/07/2022]","[07/06/2022, 05/07/2022]","[$ 1300,0 reais, $ 2800,0 reais]"
4,C301 (blocoAP),"[05/06/2022, 05/07/2022]","[10/06/2022, 09/07/2022]","[$ 1400,0 reais, $ 2900,0 reais]"
5,C302 (blocoAP),"[06/06/2022, 06/07/2022]","[08/06/2022, 12/07/2022]","[$ 1500,0 reais, $ 1200,0 reais]"
6,D401 (blocoAP),"[07/06/2022, 07/07/2022]","[07/06/2022, 09/07/2022]","[$ 1600,0 reais, $ 1300,0 reais]"
7,D402 (blocoAP),"[08/06/2022, 08/07/2022]","[10/06/2022, 14/07/2022]","[$ 1700,0 reais, $ 1400,0 reais]"
8,E501 (blocoAP),"[09/06/2022, 09/07/2022]","[10/06/2022, 09/07/2022]","[$ 1800,0 reais, $ 1500,0 reais]"
9,E502 (blocoAP),"[10/06/2022, 10/07/2022]","[16/06/2022, 12/07/2022]","[$ 1900,0 reais, $ 1600,0 reais]"
10,F601 (blocoAP),"[11/06/2022, 11/07/2022]","[17/06/2022, 13/07/2022]","[$ 2000,0 reais, $ 1000,0 reais]"
11,F602 (blocoAP),"[12/06/2022, 12/07/2022]","[15/06/2022, 12/07/2022]","[$ 2100,0 reais, $ 1100,0 reais]"
12,G701 (blocoAP),"[13/06/2022, 13/07/2022]","[19/06/2022, 20/07/2022]","[$ 2200,0 reais, $ 1200,0 reais]"
13,G702 (blocoAP),"[14/06/2022, 14/07/2022]","[15/06/2022, 17/07/2022]","[$ 2300,0 reais, $ 2100,0 reais]"
14,H801 (blocoAP),"[15/06/2022, 15/07/2022]","[18/06/2022, 16/07/2022]","[$ 2400,0 reais, $ 2200,0 reais]"

#### Organizando e etendendo os dados

In [83]:
colunas = list(df_loc.columns)
colunas

# Destrinchar as listas com explode
df_loc = df_loc.explode(colunas[1:])
# Resetar os index das linhas
df_loc.reset_index(drop=True,inplace=True)
# Observar o DataFrame
df_loc.head()

,apartamento,datas_combinadas_pagamento,datas_de_pagamento,valor_aluguel
0,A101 (blocoAP),01/06/2022,05/06/2022,"$ 1000,0 reais"
1,A101 (blocoAP),01/07/2022,03/07/2022,"$ 2500,0 reais"
2,A102 (blocoAP),02/06/2022,02/06/2022,"$ 1100,0 reais"
3,A102 (blocoAP),02/07/2022,06/07/2022,"$ 2600,0 reais"
4,B201 (blocoAP),03/06/2022,07/06/2022,"$ 1200,0 reais"

#### Dados Numéricos

In [84]:
df_loc['valor_aluguel'] = df_loc['valor_aluguel'].apply(lambda x: x.replace('$ ', '').replace(',','.').replace(' reais','').strip())
df_loc['valor_aluguel'] = df_loc['valor_aluguel'].astype(np.float64)
df_loc.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 30 entries, 0 to 29
Data columns (total 4 columns):
 #   Column                      Non-Null Count  Dtype
---  ------                      --------------  -----
 0   apartamento                 30 non-null     object
 1   datas_combinadas_pagamento  30 non-null     object
 2   datas_de_pagamento          30 non-null     object
 3   valor_aluguel               30 non-null     float64
dtypes: float64(1), object(3)
memory usage: 1.1+ KB

#### Dados Textuais

Com isso, manipule os textos na coluna apartamento para remover o texto (blocoAP) do DataFrame.

In [88]:
# Removendo 
df_loc['apartamento'] = df_loc['apartamento'].str.replace('\(blocoAP\)','', regex=True)
df_loc.head()

  apartamento datas_combinadas_pagamento datas_de_pagamento  valor_aluguel
0       A101                  01/06/2022         05/06/2022         1000.0
1       A101                  01/07/2022         03/07/2022         2500.0
2       A102                  02/06/2022         02/06/2022         1100.0
3       A102                  02/07/2022         06/07/2022         2600.0
4       B201                  03/06/2022         07/06/2022         1200.0